In [31]:
import pandas as pd

In [32]:
df=pd.read_csv('agora.csv')

In [33]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [34]:
df.shape

(50, 5)

In [35]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

# Replacing null values of age with mean age

In [36]:
from sklearn.preprocessing import LabelEncoder as LE

In [37]:
fillTrans=df.Transport.mean()
df.Transport=df.Transport.fillna(fillTrans)
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# One Hot Encoding of Area

In [38]:
import numpy as np

In [39]:
from sklearn.preprocessing import OneHotEncoder

In [40]:
onehotencoder = OneHotEncoder()

In [41]:
dummy=pd.get_dummies(df.Area, drop_first=True)

In [42]:
dummy.head()

   Dhaka  Rangpur
0      1        0
1      0        0
2      0        1
3      1        0
4      0        1

In [43]:
df=df.drop("Area", axis=1)

In [44]:
df.head()

   Marketing Spend  Administration  Transport     Profit
0        114523.61       136897.80  471784.10  192261.83
1        162597.70       151377.59  443898.53  191792.06
2        153441.51       101145.55  407934.54  191050.39
3        144372.41       118671.85  383199.62  182901.99
4        142107.34        91391.77  366168.42  166187.94

In [47]:
df=pd.concat([df, dummy], axis=1)

In [48]:
df.shape

(50, 6)

In [49]:
dummy.shape

(50, 2)

In [51]:
df.head()

   Marketing Spend  Administration  Transport     Profit  Dhaka  Rangpur
0        114523.61       136897.80  471784.10  192261.83      1        0
1        162597.70       151377.59  443898.53  191792.06      0        0
2        153441.51       101145.55  407934.54  191050.39      0        1
3        144372.41       118671.85  383199.62  182901.99      1        0
4        142107.34        91391.77  366168.42  166187.94      0        1

# Standard Scalar

In [57]:
from sklearn.preprocessing import StandardScaler

In [59]:
std=StandardScaler()

In [65]:
z=df.drop(["Dhaka", "Rangpur"], axis=1)

In [66]:
z.head()

   Marketing Spend  Administration  Transport     Profit
0        114523.61       136897.80  471784.10  192261.83
1        162597.70       151377.59  443898.53  191792.06
2        153441.51       101145.55  407934.54  191050.39
3        144372.41       118671.85  383199.62  182901.99
4        142107.34        91391.77  366168.42  166187.94

In [69]:
z=std.fit_transform(z)

In [71]:
df_1=pd.DataFrame(z, columns=["Marketing Spend","Administration", "Transport", "Profit"])

In [72]:
df_1.head()

   Marketing Spend  Administration  Transport    Profit
0         0.897913        0.560753   2.187271  2.011203
1         1.955860        1.082807   1.949436  1.999430
2         1.754364       -0.728257   1.642701  1.980842
3         1.554784       -0.096365   1.431738  1.776627
4         1.504937       -1.079919   1.286479  1.357740

In [77]:
df_2=df.drop(["Marketing Spend","Administration", "Transport", "Profit"], axis=1)

In [78]:
df_2.head()

   Dhaka  Rangpur
0      1        0
1      0        0
2      0        1
3      1        0
4      0        1

In [89]:
x=pd.concat([df_1, df_2], axis=1)

In [90]:
x.head()

   Marketing Spend  Administration  Transport    Profit  Dhaka  Rangpur
0         0.897913        0.560753   2.187271  2.011203      1        0
1         1.955860        1.082807   1.949436  1.999430      0        0
2         1.754364       -0.728257   1.642701  1.980842      0        1
3         1.554784       -0.096365   1.431738  1.776627      1        0
4         1.504937       -1.079919   1.286479  1.357740      0        1

In [93]:
y=x.drop(["Marketing Spend","Administration", "Transport", "Dhaka", "Rangpur"], axis=1)

In [97]:
y.head()

     Profit
0  2.011203
1  1.999430
2  1.980842
3  1.776627
4  1.357740

In [95]:
x=x.drop('Profit', axis=1)

In [96]:
x.head()

   Marketing Spend  Administration  Transport  Dhaka  Rangpur
0         0.897913        0.560753   2.187271      1        0
1         1.955860        1.082807   1.949436      0        0
2         1.754364       -0.728257   1.642701      0        1
3         1.554784       -0.096365   1.431738      1        0
4         1.504937       -1.079919   1.286479      0        1

In [98]:
from sklearn.model_selection import train_test_split as tts
xtrain, xtest, ytrain, ytest=tts(x,y,test_size=0.3,random_state=102)

In [99]:
xtrain.head()

    Marketing Spend  Administration  Transport  Dhaka  Rangpur
12         0.443260        0.215449   0.294315      0        1
17         0.460720        0.855666   0.573509      1        0
30        -0.258074       -0.205629  -1.059300      0        1
42        -1.102106       -0.906938  -0.574260      0        0
5          1.279800       -0.776239   1.258274      1        0

In [100]:
xtest.head()

    Marketing Spend  Administration  Transport  Dhaka  Rangpur
37        -0.652532       -2.525994  -0.156100      0        0
23        -0.136201       -0.562211   0.762804      0        1
26         0.035370        0.821718  -0.693248      0        1
20         0.055726       -0.269588   0.710741      0        0
29        -0.178609        1.142457  -0.922776      1        0

In [101]:
ytrain.head()

      Profit
12  0.741155
17  0.334771
30 -0.302625
42 -1.015365
5   1.127250

In [102]:
xtrain.shape

(35, 5)

In [103]:
ytrain.shape

(35, 1)

In [104]:
xtest.shape

(15, 5)

In [105]:
ytest.shape

(15, 1)

# Linear Regression

In [106]:
from sklearn.linear_model import LinearRegression as LR
reg=LR()

In [107]:
reg.fit(xtrain, ytrain)

LinearRegression()

In [108]:
reg.coef_

array([[ 0.73629148,  0.03968858,  0.26945227, -0.00870109, -0.05662669]])

In [109]:
reg.intercept_

array([0.01360338])

In [110]:
ypred=reg.predict(xtest)

In [111]:
from sklearn.metrics import mean_squared_error as mse

In [112]:
mse(ytest, ypred)

0.024164965256104884

In [113]:
from sklearn.metrics import r2_score

In [114]:
score=r2_score(ytest, ypred)

In [115]:
score

0.945820249616735